unit constants;

interface

const
  PatternProcess: array [0 .. 3] of string[9] = ('Поковка', 'Штамповка',
    'Прокат', 'Отливка');
  Finish: array [0 .. 2] of string[12] = ('Фрезерование', 'Шлифование',
    'Полирование');
  ToolStr: array [0 .. 2] of string[13] = ('Фреза', 'Долбяк новый',
    'Долбяк старый');
  HandleStr: array [0 .. 5] of string[16] = ('Улучшение',
    'Нормализация', 'Объемная закалка', 'Закалка ТВЧ', 'Цементация', // 5
    'Нитроцементация');
  roughness: array [0 .. 2] of string = ('Ra1.6', 'Ra3.2', 'Ra6.3');
  marca1: array [0 .. 24] of string[22] = ('12ХН2 ГОСТ 4543-71',
    '12ХН3А ГОСТ 4543-71', '12Х2Н4А ГОСТ 4543-71', '15ХГНТА ГОСТ 4543-71',
    '18ХГТ ГОСТ 4543-71', '18Х2Н4ВА ГОСТ 4543-71', '20Х ГОСТ 4543-71',
    '20ХН ГОСТ 4543-71', '20ХН2М ГОСТ 4543-71', '20ХН3А ГОСТ 4543-71',
    '20Х2Н4А ГОСТ 4543-71', '20ХГР ГОСТ 4543-71', '25ХГТМА ГОСТ 4543-7',
    '30ХГТ ГОСТ 4543-71', '25ХГМ ГОСТ 4543-71', '25ХГТ ГОСТ 4543-71',
    '30ХГТ ГОСТ 4543-71', '35ХМ ГОСТ 4543-71', '40 ГОСТ 1050-74',
    '40Х ГОСТ 4543-71', '40ХН ГОСТ 4543-71', '40ХФА ГОСТ 4543-71',
    '40ХН2МА ГОСТ 4543-71', '45 ГОСТ 1050-74', '50ХН ГОСТ 1050-74');
  ihmin: extended = 3;
  ihmax: extended = 14;
  KPD: Extended = 0.96;
  pmax: Extended = 200;
  pmin: Extended = 0.1;
  nmax: integer = 10000;
  nmin: integer = 10;
  nwmax: byte = 3;
  nwmin: byte = 3;
implementation

end.
